04_OpenFoam/_Tut_02/OpenFOAM-14/multiphaseEuler/wallCondensation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    length      2;
    width       0.34;
    lengthCells 100;
    widthCells  17;
}

vertices
(
    (0 0 0)
    ($!backgroundMesh/width 0 0)
    (0 $!backgroundMesh/width 0)
    ($!backgroundMesh/width $!backgroundMesh/width 0)

    (0 0 $!backgroundMesh/length)
    ($!backgroundMesh/width 0 $!backgroundMesh/length)
    (0 $!backgroundMesh/width $!backgroundMesh/length)
    ($!backgroundMesh/width $!backgroundMesh/width $!backgroundMesh/length)
);

blocks
(
    hex (0 1 3 2 4 5 7 6)
    (1 $!backgroundMesh/widthCells $!backgroundMesh/lengthCells)
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 3 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 7 6)
        );
    }
    wall_frontBack
    {
        type empty;
        faces
        (
            (0 4 6 2)
            (1 5 7 3)
        );
    }
    wall_cooled
    {
        type wall;
        faces
        (
            (1 0 4 5)
        );
    }
    wall_side
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
);


// ************************************************************************* //
