04_OpenFoam/_Tut_02/OpenFOAM-14/multiphaseEuler/wallCondensation/constant/heatTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      heatTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blending        default;

gas_dispersedIn_liquid_inThe_gas
{
    type spherical;
}

gas_dispersedIn_liquid_inThe_liquid
{
    type RanzMarshall;
}
liquid_dispersedIn_gas_inThe_liquid
{
    type spherical;
}
liquid_dispersedIn_gas_inThe_gas
{
    type RanzMarshall;
}

// ************************************************************************* //
